memtier/performance/data/armorix/all-6.out
12        Threads
50        Connections per thread
50        Seconds


ALL STATS
============================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.5 Latency   p99.9 Latency       KB/sec 
--------------------------------------------------------------------------------------------------------------------------------------------
Sets        35295.99          ---          ---         1.58175         1.55900         2.20700         3.03900         5.21500      2408.76 
Gets       352901.85        36.00    352865.86         1.54119         1.52700         1.87100         2.91100         4.67100      8923.94 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---          --- 
Totals     388197.85        36.00    352865.86         1.54488         1.52700         1.89500         2.91100         4.73500     11332.70 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.095        0.000
SET       1.423        5.000
SET       1.447       10.000
SET       1.463       15.000
SET       1.479       20.000
SET       1.495       25.000
SET       1.503       30.000
SET       1.519       35.000
SET       1.535       40.000
SET       1.543       45.000
SET       1.559       50.000
SET       1.567       52.500
SET       1.575       55.000
SET       1.583       57.500
SET       1.591       60.000
SET       1.591       62.500
SET       1.599       65.000
SET       1.607       67.500
SET       1.615       70.000
SET       1.623       72.500
SET       1.639       75.000
SET       1.639       76.250
SET       1.647       77.500
SET       1.647       78.750
SET       1.655       80.000
SET       1.663       81.250
SET       1.663       82.500
SET       1.671       83.750
SET       1.679       85.000
SET       1.687       86.250
SET       1.687       87.500
SET       1.695       88.125
SET       1.695       88.750
SET       1.703       89.375
SET       1.711       90.000
SET       1.711       90.625
SET       1.719       91.250
SET       1.719       91.875
SET       1.727       92.500
SET       1.735       93.125
SET       1.743       93.750
SET       1.743       94.062
SET       1.743       94.375
SET       1.751       94.688
SET       1.751       95.000
SET       1.759       95.312
SET       1.767       95.625
SET       1.767       95.938
SET       1.775       96.250
SET       1.783       96.562
SET       1.791       96.875
SET       1.791       97.031
SET       1.799       97.188
SET       1.807       97.344
SET       1.815       97.500
SET       1.815       97.656
SET       1.831       97.812
SET       1.839       97.969
SET       1.855       98.125
SET       1.871       98.281
SET       1.895       98.438
SET       1.911       98.516
SET       1.927       98.594
SET       1.959       98.672
SET       1.999       98.750
SET       2.047       98.828
SET       2.111       98.906
SET       2.191       98.984
SET       2.271       99.062
SET       2.399       99.141
SET       2.559       99.219
SET       2.703       99.258
SET       2.799       99.297
SET       2.863       99.336
SET       2.911       99.375
SET       2.943       99.414
SET       2.975       99.453
SET       3.023       99.492
SET       3.071       99.531
SET       3.119       99.570
SET       3.167       99.609
SET       3.199       99.629
SET       3.231       99.648
SET       3.247       99.668
SET       3.279       99.688
SET       3.327       99.707
SET       3.391       99.727
SET       3.487       99.746
SET       3.631       99.766
SET       3.823       99.785
SET       4.015       99.805
SET       4.127       99.814
SET       4.255       99.824
SET       4.351       99.834
SET       4.447       99.844
SET       4.575       99.854
SET       4.703       99.863
SET       4.831       99.873
SET       4.959       99.883
SET       5.087       99.893
SET       5.247       99.902
SET       5.311       99.907
SET       5.343       99.912
SET       5.439       99.917
SET       5.503       99.922
SET       5.599       99.927
SET       5.663       99.932
SET       5.759       99.937
SET       5.855       99.941
SET       5.951       99.946
SET       6.047       99.951
SET       6.079       99.954
SET       6.111       99.956
SET       6.143       99.958
SET       6.207       99.961
SET       6.239       99.963
SET       6.303       99.966
SET       6.367       99.968
SET       6.399       99.971
SET       6.463       99.973
SET       6.495       99.976
SET       6.527       99.977
SET       6.591       99.978
SET       6.655       99.979
SET       6.783       99.980
SET       6.975       99.982
SET       7.167       99.983
SET       7.327       99.984
SET       7.583       99.985
SET       7.903       99.987
SET       8.319       99.988
SET       8.511       99.988
SET       8.831       99.989
SET       9.023       99.990
SET       9.215       99.990
SET       9.535       99.991
SET       9.727       99.991
SET       9.983       99.992
SET      10.175       99.993
SET      10.431       99.993
SET      10.687       99.994
SET      10.815       99.994
SET      10.943       99.995
SET      11.007       99.995
SET      11.135       99.995
SET      11.263       99.995
SET      11.391       99.996
SET      11.455       99.996
SET      11.647       99.996
SET      11.711       99.997
SET      11.839       99.997
SET      11.839       99.997
SET      11.903       99.997
SET      11.967       99.997
SET      12.031       99.998
SET      12.159       99.998
SET      12.159       99.998
SET      12.223       99.998
SET      12.287       99.998
SET      12.351       99.998
SET      12.415       99.998
SET      12.415       99.999
SET      12.479       99.999
SET      12.543       99.999
SET      12.543       99.999
SET      12.543       99.999
[...]
SET      12.607       99.999
SET      12.607       99.999
SET      12.671       99.999
SET      12.671       99.999
SET      12.671       99.999
[...]
SET      12.735       99.999
SET      12.735       99.999
SET      12.735       99.999
[...]
SET      12.799      100.000
SET      12.799      100.000
SET      12.799      100.000
[...]
SET      12.863      100.000
SET      12.863      100.000
SET      12.863      100.000
[...]
SET      12.927      100.000
SET      12.927      100.000
SET      12.927      100.000
[...]
SET      12.991      100.000
SET      12.991      100.000
---
GET       0.063        0.000
GET       1.383        5.000
GET       1.415       10.000
GET       1.431       15.000
GET       1.447       20.000
GET       1.463       25.000
GET       1.471       30.000
GET       1.487       35.000
GET       1.503       40.000
GET       1.511       45.000
GET       1.527       50.000
GET       1.527       52.500
GET       1.535       55.000
GET       1.543       57.500
GET       1.551       60.000
GET       1.559       62.500
GET       1.567       65.000
GET       1.575       67.500
GET       1.583       70.000
GET       1.591       72.500
GET       1.599       75.000
GET       1.599       76.250
GET       1.607       77.500
GET       1.615       78.750
GET       1.615       80.000
GET       1.623       81.250
GET       1.623       82.500
GET       1.631       83.750
GET       1.639       85.000
GET       1.647       86.250
GET       1.655       87.500
GET       1.655       88.125
GET       1.655       88.750
GET       1.663       89.375
GET       1.663       90.000
GET       1.671       90.625
GET       1.671       91.250
GET       1.679       91.875
GET       1.687       92.500
GET       1.687       93.125
GET       1.695       93.750
GET       1.695       94.062
GET       1.703       94.375
GET       1.703       94.688
GET       1.711       95.000
GET       1.711       95.312
GET       1.719       95.625
GET       1.719       95.938
GET       1.727       96.250
GET       1.735       96.562
GET       1.735       96.875
GET       1.743       97.031
GET       1.743       97.188
GET       1.751       97.344
GET       1.751       97.500
GET       1.759       97.656
GET       1.759       97.812
GET       1.767       97.969
GET       1.775       98.125
GET       1.783       98.281
GET       1.791       98.438
GET       1.799       98.516
GET       1.799       98.594
GET       1.807       98.672
GET       1.815       98.750
GET       1.831       98.828
GET       1.847       98.906
GET       1.863       98.984
GET       1.895       99.062
GET       1.943       99.141
GET       2.079       99.219
GET       2.175       99.258
GET       2.287       99.297
GET       2.447       99.336
GET       2.639       99.375
GET       2.799       99.414
GET       2.847       99.453
GET       2.895       99.492
GET       2.943       99.531
GET       2.975       99.570
GET       3.023       99.609
GET       3.039       99.629
GET       3.071       99.648
GET       3.103       99.668
GET       3.135       99.688
GET       3.167       99.707
GET       3.199       99.727
GET       3.231       99.746
GET       3.263       99.766
GET       3.327       99.785
GET       3.423       99.805
GET       3.503       99.814
GET       3.615       99.824
GET       3.743       99.834
GET       3.887       99.844
GET       4.031       99.854
GET       4.159       99.863
GET       4.287       99.873
GET       4.415       99.883
GET       4.575       99.893
GET       4.703       99.902
GET       4.767       99.907
GET       4.863       99.912
GET       4.927       99.917
GET       5.023       99.922
GET       5.087       99.927
GET       5.151       99.932
GET       5.247       99.937
GET       5.311       99.941
GET       5.407       99.946
GET       5.471       99.951
GET       5.535       99.954
GET       5.567       99.956
GET       5.631       99.958
GET       5.663       99.961
GET       5.727       99.963
GET       5.759       99.966
GET       5.823       99.968
GET       5.887       99.971
GET       5.919       99.973
GET       5.983       99.976
GET       6.015       99.977
GET       6.047       99.978
GET       6.079       99.979
GET       6.143       99.980
GET       6.143       99.982
GET       6.175       99.983
GET       6.207       99.984
GET       6.239       99.985
GET       6.271       99.987
GET       6.303       99.988
GET       6.335       99.988
GET       6.367       99.989
GET       6.367       99.990
GET       6.399       99.990
GET       6.399       99.991
GET       6.431       99.991
GET       6.431       99.992
GET       6.463       99.993
GET       6.463       99.993
GET       6.495       99.994
GET       6.495       99.994
GET       6.527       99.995
GET       6.527       99.995
GET       6.527       99.995
GET       6.559       99.995
GET       6.559       99.996
GET       6.591       99.996
GET       6.623       99.996
GET       6.623       99.997
GET       6.655       99.997
GET       6.687       99.997
GET       6.687       99.997
GET       6.719       99.997
GET       6.751       99.998
GET       6.783       99.998
GET       6.815       99.998
GET       6.879       99.998
GET       6.911       99.998
GET       7.007       99.998
GET       7.071       99.998
GET       7.103       99.999
GET       7.135       99.999
GET       7.231       99.999
GET       7.295       99.999
GET       7.391       99.999
GET       7.391       99.999
GET       7.455       99.999
GET       7.519       99.999
GET       7.583       99.999
GET       7.583       99.999
GET       7.647       99.999
GET       7.679       99.999
GET       7.743       99.999
GET       7.743       99.999
GET       7.743       99.999
GET       7.807       99.999
GET       7.839      100.000
GET       7.839      100.000
GET       7.839      100.000
[...]
GET       7.871      100.000
GET       7.871      100.000
GET       7.871      100.000
[...]
GET       7.903      100.000
GET       7.903      100.000
GET       7.903      100.000
GET       7.935      100.000
GET       7.967      100.000
GET       8.191      100.000
GET       8.191      100.000
GET       8.255      100.000
GET       8.319      100.000
GET       8.447      100.000
GET       8.575      100.000
GET       8.703      100.000
GET       8.831      100.000
GET       8.959      100.000
GET       8.959      100.000
GET       8.959      100.000
[...]
GET       9.087      100.000
GET       9.151      100.000
GET       9.279      100.000
GET       9.279      100.000
GET       9.279      100.000
GET       9.727      100.000
GET       9.727      100.000
GET       9.855      100.000
GET       9.855      100.000
GET       9.855      100.000
GET       9.983      100.000
GET       9.983      100.000
GET       9.983      100.000
[...]
GET      10.047      100.000
GET      10.047      100.000
GET      10.047      100.000
[...]
GET      10.367      100.000
GET      10.367      100.000
---
WAIT      0.000      100.000